{
  "session_only": true,
  "session_only_desc": "Minimizes data usage and speed up requests by only saving session cookies, disable if you need other cookies to be saved as well.",

  "getPlayers": {
    "interval": 1000,
    "interval_desc": "Number of requests (pages) sent at once (a loop runs this number of times creating requests)",
    "delay": 3000,
    "delay_desc": "Time (in ms) to wait after each interval, otherwise ROBLOX may block your requests and too many requests will be made at once to be processed correctly."
  },

  "cache": {
    "XCSRF": {
      "expire": 1800,
      "refresh": false,
      "desc": "XCSRF tokens expire 30 minutes after being created. Until they expire, however, no new tokens can be made. Sometimes an XCSRF token has already been created for the user so the server doesn't know when to collect a new one. During transitions some requests may use invalid tokens. For now, new XCSRF tokens are automatically retrieved when cached ones get rejected."
    },

    "Verify": {
      "expire": 7200,
      "refresh": 3600,
      "desc": "Verification tokens seem to last extremely long times."
     },

    "Roles": {
      "expire": 600,
      "refresh": true,
      "desc": "This should be fine unless your group changes its ranks often."
     },

    "RolesetId": {
      "expire": 86400,
      "refresh": false,
      "desc": "Disable this completely if you don't plan on ever changing your exile bot's rank."
     },

    "Product": {
      "expire": false,
      "refresh": false,
      "desc": "Disabled by default for security (price checks). If you are only working with ROBLOX assets, however, you can set this to something high (since ROBLOX product info rarely changes)."
     },

    "NameFromID": {
      "expire": false,
      "refresh": false,
      "desc": "Caches a user's username based on their ID. It is not on by default because it is an uncontrollable change but the option is there to cache it if you would like."
     },

    "IDFromName": {
      "expire": true,
      "refresh": false,
      "desc": "Permanent cache for a user's ID based on their name. There is no reason this would ever change (changing names would re-match it and old names cannot be reused by other accounts). Only disable if you want this to match current names only."
     },

    "Rank": {
      "expire": false,
      "refresh": false,
      "desc": "Caches rank by user ID. Changes cannot be anticipated so this is not enabled by default."
     },
     
     "GetBlurb": {
       "expire": false,
       "refresh": false,
       "desc": "Caches blurb by user ID. The next blurb's content and timing will not be known so refresh and expire are disabled."
     }
  }
}
